# Conduit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireType..::..Conduit Property
WireType Class See Also
---
The conduit type of the wire type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireConduitType Conduit { get; set; }
```

Visual Basic
---
```text
Public Property Conduit As WireConduitType
	Get
	Set
```

Visual C++
---
```text
public:
property WireConduitType^ Conduit {
	WireConduitType^ get ();
	void set (WireConduitType^ value);
}
```

# See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace